lixc929/hardware/firmware/ch585/applications/half_scan/main.c
#include "CONFIG.h"
#include "HAL.h"

#include <string.h>

#include "aik_approval_control.h"
#include "aik_host_shortcut.h"
#include "aik_spi_protocol.h"
#include "ch585_ads7948_mux_acq.h"
#include "ch585_half_report.h"
#include "ch585_profile.h"

#ifndef CH585_BATTERY_ENABLE
#define CH585_BATTERY_ENABLE 0
#endif
#if CH585_BATTERY_ENABLE
#include "ch585_i2c_bus.h"
#include "ch585_power_status.h"
#include "ch585_soft_i2c_bus.h"
#include "max17048.h"
#endif

#ifndef CH585_BLE_PAIRING_EXT_EEPROM
#define CH585_BLE_PAIRING_EXT_EEPROM 0
#endif
#if CH585_BLE_PAIRING_EXT_EEPROM
#include "ch585_eeprom_i2c.h"
#endif
#if CH585_BLE_HID_ENABLE
#include "ble_hid.h"
#endif
#include "ch585_rf_nkro_tx.h"
#include "ch585_spi0_slave_link.h"
#include "magnetic_key_engine.h"

__attribute__((aligned(4))) uint32_t MEM_BUF[BLE_MEMHEAP_SIZE / 4];

#ifndef CH585_HALF_ID
#define CH585_HALF_ID AIK_HALF_ID_LEFT
#endif

#ifndef CH585_RF_TX_ENABLE
#define CH585_RF_TX_ENABLE 0
#endif

#ifndef CH585_BLE_HID_ENABLE
#define CH585_BLE_HID_ENABLE 0
#endif

#ifndef CH585_SPI_ACCEPT_HOST_CMD
#define CH585_SPI_ACCEPT_HOST_CMD (CH585_RF_TX_ENABLE || CH585_BLE_HID_ENABLE)
#endif

#ifndef CH585_HALF_SCAN_DEBUG_UART
#define CH585_HALF_SCAN_DEBUG_UART 0
#endif

#ifndef CH585_HALF_SCAN_DEBUG_UART_BAUD
#define CH585_HALF_SCAN_DEBUG_UART_BAUD 921600U
#endif

#ifndef CH585_HALF_SCAN_DEBUG_PERIOD_FRAMES
#define CH585_HALF_SCAN_DEBUG_PERIOD_FRAMES 100U
#endif

#ifndef CH585_LOCAL_ROTARY_PULSE_FRAMES
#define CH585_LOCAL_ROTARY_PULSE_FRAMES 6U
#endif

#ifndef CH585_LOCAL_WHEEL_PULSE_FRAMES
#define CH585_LOCAL_WHEEL_PULSE_FRAMES 32U
#endif

#ifndef CH585_LOCAL_ROTARY_QUAD_STEPS_PER_EVENT
#define CH585_LOCAL_ROTARY_QUAD_STEPS_PER_EVENT 2
#endif

#ifndef CH585_LOCAL_ROTARY_QUAD_STEPS_PER_EVENT_RIGHT
#define CH585_LOCAL_ROTARY_QUAD_STEPS_PER_EVENT_RIGHT 2
#endif

#ifndef CH585_LOCAL_SWITCH_DEBOUNCE_FRAMES
#define CH585_LOCAL_SWITCH_DEBOUNCE_FRAMES 3U
#endif

#ifndef CH585_LOCAL_SWITCH_ENTER_GUARD_FRAMES
#define CH585_LOCAL_SWITCH_ENTER_GUARD_FRAMES 50U
#endif

#ifndef CH585_LOCAL_SWITCH_ENTER_PULSE_FRAMES
#define CH585_LOCAL_SWITCH_ENTER_PULSE_FRAMES 6U
#endif

#ifndef CH585_LOCAL_BUTTON_DEBOUNCE_FRAMES
#define CH585_LOCAL_BUTTON_DEBOUNCE_FRAMES 12U
#endif

#ifndef CH585_LOCAL_BUTTON_PULSE_FRAMES
#define CH585_LOCAL_BUTTON_PULSE_FRAMES 6U
#endif

#ifndef CH585_LOCAL_BUTTON_COOLDOWN_FRAMES
#define CH585_LOCAL_BUTTON_COOLDOWN_FRAMES 100U
#endif

#ifndef CH585_BATTERY_SAMPLE_FRAMES
#define CH585_BATTERY_SAMPLE_FRAMES 4096U
#endif

#ifndef BLE_HID_KBD_REPORT_LEN
#define BLE_HID_KBD_REPORT_LEN 8U
#endif

#define CH585_LOCAL_SWITCH_CENTER_MASK 0x01U
#define CH585_LOCAL_SWITCH_UP_MASK     0x02U
#define CH585_LOCAL_SWITCH_DOWN_MASK   0x04U
#define CH585_LOCAL_SWITCH_RIGHT_MASK  0x08U
#define CH585_LOCAL_SWITCH_LEFT_MASK   0x10U
#define CH585_LOCAL_SWITCH_DIR_MASK    0x1EU

#define CH585_LOCAL_SWITCH_GESTURE_NONE    0U
#define CH585_LOCAL_SWITCH_GESTURE_PENDING 1U
#define CH585_LOCAL_SWITCH_GESTURE_ENTER   2U
#define CH585_LOCAL_SWITCH_GESTURE_DIR     3U

#if CH585_HALF_SCAN_DEBUG_UART && !defined(DEBUG)
#error CH585_HALF_SCAN_DEBUG_UART requires DEBUG=Debug_UART1 or another WCH DEBUG UART.
#endif

static ch585_ads7948_mux_acq_t s_acq;
static mag_key_engine_t s_engine;
static aik_spi_half_state_v1_t s_tx_frame __attribute__((aligned(4)));
static aik_spi_host_cmd_v1_t s_rx_cmd __attribute__((aligned(4)));
static aik_spi_profile_status_v1_t s_profile_status __attribute__((aligned(4)));
static aik_spi_profile_xfer_v1_t s_profile_xfer __attribute__((aligned(4)));
static aik_spi_half_state_v1_t s_right_frame __attribute__((aligned(4)));
static uint8_t s_rf_nkro16[AIK_NKRO_REPORT_BYTES];
#if CH585_BLE_HID_ENABLE
static uint8_t s_ble_boot8[BLE_HID_KBD_REPORT_LEN];
#endif
static uint16_t s_compact_raw[AIK_KEY_COUNT_RIGHT];
static int s_last_spi_result;
static uint8_t s_profile_status_pending;
static uint8_t s_profile_xfer_pending;
static uint8_t s_right_frame_valid;
#if CH585_BATTERY_ENABLE
static ch585_i2c_bus_t s_battery_bus;
static max17048_t s_battery_gauge;
static ch585_power_status_config_t s_battery_cfg;
static ch585_power_status_t s_battery_status;
static uint16_t s_battery_sample_countdown;
static uint8_t s_battery_read_failures;
#endif
static uint8_t s_local_rotary_last_ab;
static int8_t s_local_rotary_accum;
static uint8_t s_local_rotary_cw_frames;
static uint8_t s_local_rotary_ccw_frames;
static uint32_t s_local_rotary_cw_total;
static uint32_t s_local_rotary_ccw_total;
static uint8_t s_local_rotary_debug_last_raw_ab;
static uint32_t s_local_rotary_debug_edge_count;
static volatile uint32_t s_local_rotary_debug_irq_count;
static volatile uint16_t s_local_rotary_debug_irq_flags;
static int16_t s_local_mouse_wheel_pending;
static uint8_t s_local_button_last_raw;
static uint8_t s_local_button_stable;
static uint8_t s_local_button_last_stable;
static uint8_t s_local_button_raw_count;
static uint8_t s_local_button_mute_frames;
static uint8_t s_local_button_mute_cooldown;
static uint8_t s_local_button_press_latched;
static uint8_t s_local_switch_last_raw;
static uint8_t s_local_switch_stable;
static uint8_t s_local_switch_raw_count;
static uint8_t s_local_switch_gesture;
static uint8_t s_local_switch_guard_frames;
static uint8_t s_local_switch_enter_frames;
#if CH585_BLE_HID_ENABLE
static uint32_t s_ble_sent_count;
static uint32_t s_ble_drop_count;
static uint16_t s_ble_last_consumer_usage;
#endif
#if CH585_RF_TX_ENABLE || CH585_BLE_HID_ENABLE
static uint8_t s_output_mode;
static int8_t s_last_output_mouse_wheel;
#endif

static ch585_ads7948_mux_side_t half_scan_side(void)
{
    return (CH585_HALF_ID == AIK_HALF_ID_RIGHT) ?
        CH585_ADS7948_MUX_SIDE_RIGHT :
        CH585_ADS7948_MUX_SIDE_LEFT;
}

#if CH585_BATTERY_ENABLE
static void half_scan_battery_sample(void)
{
    max17048_sample_t sample;
    uint8_t alert_low =
        (GPIOB_ReadPortPin(GPIO_Pin_5) == 0U) ? 1U : 0U;

    if(max17048_read_sample(&s_battery_gauge,
                            alert_low,
                            &sample) == MAX17048_STATUS_OK)
    {
        ch585_power_status_from_sample(
            &s_battery_cfg,
            &sample,
            (uint8_t)(GPIOB_ReadPortPin(GPIO_Pin_6) != 0U),
            (uint8_t)(GPIOB_ReadPortPin(GPIO_Pin_7) != 0U),
            &s_battery_status);
        s_battery_read_failures = 0U;
        return;
    }

    if(s_battery_read_failures < 3U)
    {
        s_battery_read_failures++;
    }
    if(s_battery_read_failures >= 3U)
    {
        ch585_power_status_from_sample(
            &s_battery_cfg,
            0,
            (uint8_t)(GPIOB_ReadPortPin(GPIO_Pin_6) != 0U),
            (uint8_t)(GPIOB_ReadPortPin(GPIO_Pin_7) != 0U),
            &s_battery_status);
    }
}

static void half_scan_battery_init(void)
{
    max17048_config_t gauge_cfg;

    memset(&s_battery_status, 0, sizeof(s_battery_status));
    ch585_power_status_default_config(&s_battery_cfg);
    GPIOBDigitalCfg(ENABLE,
                    GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7 |
                    GPIO_Pin_20 | GPIO_Pin_21);
    GPIOB_ModeCfg(GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7, GPIO_ModeIN_PU);

