lixc929/hardware/firmware/ch585/applications/half_scan/main.c
    (void)ch585_soft_i2c_bus_init(&s_battery_bus);
    max17048_default_config(&gauge_cfg);
    gauge_cfg.bus = &s_battery_bus;
    (void)max17048_init(&s_battery_gauge, &gauge_cfg);
    s_battery_read_failures = 0U;
    s_battery_sample_countdown = CH585_BATTERY_SAMPLE_FRAMES;
    half_scan_battery_sample();
}

static void half_scan_battery_poll(void)
{
    if(s_battery_sample_countdown != 0U)
    {
        s_battery_sample_countdown--;
        return;
    }

    s_battery_sample_countdown = CH585_BATTERY_SAMPLE_FRAMES;
    half_scan_battery_sample();
}

static uint8_t half_scan_battery_percent(void)
{
    uint16_t percent;

    if((s_battery_status.flags & CH585_POWER_FLAG_BAT_VALID) == 0U)
    {
        return AIK_BATTERY_PERCENT_UNKNOWN;
    }

    percent = (uint16_t)((s_battery_status.soc_q8_percent + 128U) >> 8U);
    return (percent > 100U) ? 100U : (uint8_t)percent;
}
#else
static void half_scan_battery_init(void)
{
}

static void half_scan_battery_poll(void)
{
}
#endif

static void half_scan_build_down_bits(void)
{
    uint8_t key;
    uint8_t key_count = aik_spi_half_key_count((uint8_t)CH585_HALF_ID);

    memset(s_tx_frame.down_bits, 0, sizeof(s_tx_frame.down_bits));
    for(key = 0U; key < key_count; key++)
    {
        const mag_key_state_t *state = mag_key_engine_state(&s_engine, key);

        if((state != 0) && (state->is_down != 0U))
        {
            s_tx_frame.down_bits[key >> 3] |= (uint8_t)(1U << (key & 7U));
        }
    }
}

static uint8_t half_scan_gpioa_pressed(uint32_t pin)
{
    return (GPIOA_ReadPortPin(pin) == 0U) ? 1U : 0U;
}

static uint8_t half_scan_gpiob_pressed(uint32_t pin)
{
    return (GPIOB_ReadPortPin(pin) == 0U) ? 1U : 0U;
}

static uint8_t half_scan_read_rotary_ab(void)
{
    uint8_t a = half_scan_gpioa_pressed(GPIO_Pin_10);
    uint8_t b = half_scan_gpioa_pressed(GPIO_Pin_11);

    return (uint8_t)(a | (uint8_t)(b << 1));
}

static uint8_t half_scan_read_rotary_raw_ab(void)
{
    uint8_t a = (GPIOA_ReadPortPin(GPIO_Pin_10) != 0U) ? 1U : 0U;
    uint8_t b = (GPIOA_ReadPortPin(GPIO_Pin_11) != 0U) ? 1U : 0U;

    return (uint8_t)(a | (uint8_t)(b << 1));
}

static void half_scan_local_gpio_init(void)
{
    GPIOADigitalCfg(ENABLE, GPIO_Pin_7 | GPIO_Pin_10 | GPIO_Pin_11);
    GPIOBDigitalCfg(ENABLE, GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7);
    GPIOA_ModeCfg(GPIO_Pin_10 | GPIO_Pin_11, GPIO_ModeIN_PU);
    s_local_rotary_debug_last_raw_ab = half_scan_read_rotary_raw_ab();
    s_local_rotary_debug_edge_count = 0U;
    s_local_rotary_debug_irq_count = 0U;
    s_local_rotary_debug_irq_flags = 0U;
#if CH585_HALF_SCAN_DEBUG_UART
    GPIOA_ClearITFlagBit(GPIO_Pin_10 | GPIO_Pin_11);
    GPIOA_ITModeCfg(GPIO_Pin_10 | GPIO_Pin_11, GPIO_ITMode_FallEdge);
    PFIC_EnableIRQ(GPIO_A_IRQn);
#endif
    if(CH585_HALF_ID == AIK_HALF_ID_LEFT)
    {
        GPIOA_ModeCfg(GPIO_Pin_7, GPIO_ModeIN_PU);
        GPIOB_ModeCfg(GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7,
                      GPIO_ModeIN_PU);
    }
    else
    {
        GPIOA_ModeCfg(GPIO_Pin_7, GPIO_ModeIN_PU);
    }

    s_local_rotary_last_ab = half_scan_read_rotary_ab();
    s_local_rotary_accum = 0;
    s_local_rotary_cw_frames = 0U;
    s_local_rotary_ccw_frames = 0U;
    s_local_rotary_cw_total = 0U;
    s_local_rotary_ccw_total = 0U;
    s_local_mouse_wheel_pending = 0;
    s_local_button_last_raw = 0U;
    s_local_button_stable = 0U;
    s_local_button_last_stable = 0U;
    s_local_button_raw_count = 0U;
    s_local_button_mute_frames = 0U;
    s_local_button_mute_cooldown = 0U;
    s_local_button_press_latched = 0U;
    s_local_switch_last_raw = 0U;
    s_local_switch_stable = 0U;
    s_local_switch_raw_count = 0U;
    s_local_switch_gesture = CH585_LOCAL_SWITCH_GESTURE_NONE;
    s_local_switch_guard_frames = 0U;
    s_local_switch_enter_frames = 0U;
}

static void half_scan_queue_local_mouse_wheel(int8_t delta)
{
    if(CH585_HALF_ID != AIK_HALF_ID_LEFT)
    {
        return;
    }

    if((delta > 0) && (s_local_mouse_wheel_pending < 32))
    {
        s_local_mouse_wheel_pending++;
    }
    else if((delta < 0) && (s_local_mouse_wheel_pending > -32))
    {
        s_local_mouse_wheel_pending--;
    }
}

#if CH585_RF_TX_ENABLE || CH585_BLE_HID_ENABLE
static int8_t half_scan_take_local_mouse_wheel(void)
{
    if(CH585_HALF_ID != AIK_HALF_ID_LEFT)
    {
        return 0;
    }

    if(s_local_mouse_wheel_pending > 0)
    {
        s_local_mouse_wheel_pending--;
        return ch585_half_report_mouse_wheel_step(
            AIK_HP_SIGNAL_WHEEL_UP);
    }
    if(s_local_mouse_wheel_pending < 0)
    {
        s_local_mouse_wheel_pending++;
        return ch585_half_report_mouse_wheel_step(
            AIK_HP_SIGNAL_WHEEL_DOWN);
    }
    return 0;
}
#endif

static uint8_t half_scan_debounce_u8(uint8_t raw,
                                     uint8_t mask,
                                     uint8_t threshold,
                                     uint8_t *last_raw,
                                     uint8_t *raw_count,
                                     uint8_t *stable)
{
    raw &= mask;
    if(raw == *last_raw)
    {
        if(*raw_count < threshold)
        {
            (*raw_count)++;
        }
    }
    else
    {
        *last_raw = raw;
        *raw_count = 1U;
    }

    if(*raw_count >= threshold)
    {
        *stable = raw;
    }
    return *stable;
}

static void half_scan_local_rotary_poll(void)
{
    static const int8_t s_quad_delta[16] =
    {
         0, -1,  1,  0,
         1,  0,  0, -1,
        -1,  0,  0,  1,
         0,  1, -1,  0
    };
    uint8_t raw_ab = half_scan_read_rotary_raw_ab();
    uint8_t next_ab = half_scan_read_rotary_ab();
    uint8_t index = (uint8_t)((s_local_rotary_last_ab << 2) | next_ab);
    uint8_t pulse_frames =
        (CH585_HALF_ID == AIK_HALF_ID_LEFT) ?
        CH585_LOCAL_WHEEL_PULSE_FRAMES :
        CH585_LOCAL_ROTARY_PULSE_FRAMES;
    int8_t steps_per_event =
        (CH585_HALF_ID == AIK_HALF_ID_RIGHT) ?
        (int8_t)CH585_LOCAL_ROTARY_QUAD_STEPS_PER_EVENT_RIGHT :
        (int8_t)CH585_LOCAL_ROTARY_QUAD_STEPS_PER_EVENT;

